In [1]:
import pandas as pd

In [2]:
# merging ot concateating datasets

In [3]:
import pandas as pd

In [4]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])

In [5]:
staff

    name  role
0  gokul    hr
1   hari    pr
2     sr  pune

In [6]:
staff

    name  role
0  gokul    hr
1   hari    pr
2     sr  pune

In [7]:
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])

In [8]:
student=student.set_index('name')

In [9]:
student

           role
name
gokul        hr
sjsjsjj  prlsls
sraa     klklkl

In [10]:
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

          name role_x  role_y
0        gokul     hr     NaN
1         hari     pr     NaN
2           sr   pune     NaN
gokul      NaN    NaN      hr
sjsjsjj    NaN    NaN  prlsls
sraa       NaN    NaN  klklkl

In [11]:
# now we want to get th e intersection set the how attribute to inner
pd.merge(staff,student,how="inner",left_index=True,right_index=True)#full outer join in similiar to union

Empty DataFrame
Columns: [name, role_x, role_y]
Index: []

In [12]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [13]:
x=obj2['California']
obj2['California']==x

False

In [14]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [15]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [16]:
df=staff.copy()

In [17]:
df=df.reset_index()
df.columns

Index(['index', 'name', 'role'], dtype='object')

In [18]:
df=df.rename(mapper=lambda x: x.upper(),axis="columns" )
df

   INDEX   NAME  ROLE
0      0  gokul    hr
1      1   hari    pr
2      2     sr  pune

In [19]:
df['score']=[10,20,1010]

In [20]:
df

   INDEX   NAME  ROLE  score
0      0  gokul    hr     10
1      1   hari    pr     20
2      2     sr  pune   1010

In [21]:
df[df['score']>10]

   INDEX  NAME  ROLE  score
1      1  hari    pr     20
2      2    sr  pune   1010

In [22]:
df.where(df['score']>10)

   INDEX  NAME  ROLE   score
0    NaN   NaN   NaN     NaN
1    1.0  hari    pr    20.0
2    2.0    sr  pune  1010.0

In [23]:
df.drop('score',axis=1)
df

   INDEX   NAME  ROLE  score
0      0  gokul    hr     10
1      1   hari    pr     20
2      2     sr  pune   1010

In [24]:
df=df.set_index('NAME')

In [25]:
df

       INDEX  ROLE  score
NAME
gokul      0    hr     10
hari       1    pr     20
sr         2  pune   1010

In [26]:
df.drop(['gokul','hari'])

      INDEX  ROLE  score
NAME
sr        2  pune   1010

In [27]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [28]:
df

       INDEX  ROLE  score
NAME
gokul      0    hr     10
hari       1    pr     20
sr         2  pune   1010

In [29]:
df.T['gokul']

INDEX     0
ROLE     hr
score    10
Name: gokul, dtype: object

In [30]:
score=pd.DataFrame(
)

In [31]:
score

Empty DataFrame
Columns: []
Index: []

In [32]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [33]:
for i in s2.iteritems():
    print(i)

('Alice', 1)
('Jack', 2)
('Molly', 3)

In [34]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [35]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [36]:
s2=s1.append(s2)

In [37]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])
staff=staff.set_index('name')
student=student.set_index('name')
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

        role_x  role_y
name
gokul       hr      hr
hari        pr     NaN
sjsjsjj    NaN  prlsls
sr        pune     NaN
sraa       NaN  klklkl

In [38]:
# left join 
# always left is first and right is second

In [39]:
pd.merge(staff,student,how="left",left_index=True,right_index=True)

      role_x role_y
name
gokul     hr     hr
hari      pr    NaN
sr      pune    NaN

In [40]:
staff

       role
name
gokul    hr
hari     pr
sr     pune

In [41]:
staff=staff.reset_index()
student=student.reset_index()
pd.merge(staff,student,how="right",left_index=True,right_index=True)

  name_x role_x   name_y  role_y
0  gokul     hr    gokul      hr
1   hari     pr  sjsjsjj  prlsls
2     sr   pune     sraa  klklkl

In [42]:
staff_df=pd.DataFrame([
    {"name":"gokul","role":"director of hr","location":"banglore"},
    {"name":"hari","role":"pr","location":"unknown"},
    {"name":"jz","role":"hr","location":"andhra"}
])
student_df=pd.DataFrame([
    {"name":"dheeraj","role":"buiness","location":"yelanka"},
    {"name":"hari","role":"pr","location":"unknown"},
    {"name":"jz","role":"hr","location":"andhra"}
])
student_df

      name     role location
0  dheeraj  buiness  yelanka
1     hari       pr  unknown
2       jz       hr   andhra

In [43]:
staff_df

    name            role  location
0  gokul  director of hr  banglore
1   hari              pr   unknown
2     jz              hr    andhra

In [44]:
pd.merge(staff_df,student_df,how="left",on="name")

    name          role_x location_x role_y location_y
0  gokul  director of hr   banglore    NaN        NaN
1   hari              pr    unknown     pr    unknown
2     jz              hr     andhra     hr     andhra

In [45]:
pd.merge(staff_df,student_df,how="right",on="name")

      name role_x location_x   role_y location_y
0     hari     pr    unknown       pr    unknown
1       jz     hr     andhra       hr     andhra
2  dheeraj    NaN        NaN  buiness    yelanka

In [46]:
staff_df=pd.DataFrame([
    {"name":"gokul","lastname":"js","role":"director of hr","location":"banglore"},
    {"name":"hari","lastname":"ps","role":"pr","location":"unknown"},
    {"name":"jz","lastname":"cs","role":"hr","location":"andhra"}
])
student_df=pd.DataFrame([
    {"name":"dheeraj","lastname":"ssss","role":"buiness","location":"yelanka"},
    {"name":"hari","lastname":"ps","role":"pr","location":"unknown"},
    {"name":"jz","lastname":"cs","role":"hr","location":"andhra"}
])

In [47]:
staff_df

    name lastname            role  location
0  gokul       js  director of hr  banglore
1   hari       ps              pr   unknown
2     jz       cs              hr    andhra

In [48]:
student_df

      name lastname     role location
0  dheeraj     ssss  buiness  yelanka
1     hari       ps       pr  unknown
2       jz       cs       hr   andhra

In [49]:
# _x is always the left dataframe and _y is always the right dataframe

In [50]:
pd.merge(staff_df,student_df,how='left',on=['name','lastname'])

    name lastname          role_x location_x role_y location_y
0  gokul       js  director of hr   banglore    NaN        NaN
1   hari       ps              pr    unknown     pr    unknown
2     jz       cs              hr     andhra     hr     andhra

In [51]:
# if merging is as joining "horizontally" then we joining all simliar values found in a dataframe then concatinating is joining vertically

In [52]:
%%capture
df_2011=pd.read_csv("MERGED2011_PP.CSV",error_bad_lines=False)
df_2012=pd.read_csv("MERGED2012_PP.CSV",error_bad_lines=False)
df_2013=pd.read_csv("MERGED2013_PP.CSV",error_bad_lines=False)
df_2011.head()

In [53]:
df_2011.head(3)
print(len(df_2011))
print(len(df_2012))
print(len(df_2013))

7675
7793
7804

In [54]:
frame=[df_2011,df_2012,df_2013]
k=pd.concat(frame)
df_2011.head()
k.head()

,UNITID,OPEID,opeid6,INSTNM,CITY,STABBR,ZIP,AccredAgency,INSTURL,NPCURL,...,PELL_RPY_3YR_RT_SUPP,NOPELL_RPY_3YR_RT_SUPP,FEMALE_RPY_3YR_RT_SUPP,MALE_RPY_3YR_RT_SUPP,FIRSTGEN_RPY_3YR_RT_SUPP,NOTFIRSTGEN_RPY_3YR_RT_SUPP,C150_L4_POOLED_SUPP,C150_4_POOLED_SUPP,C200_L4_POOLED_SUPP,C200_4_POOLED_SUPP
0,100654,100200,1002,Alabama A & M University,Normal,AL,35762,NaN,NaN,NaN,...,0.455279503106,0.5,0.504513540622,0.420550847458,0.470229007634,0.455089820359,NaN,NaN,NaN,NaN
1,100663,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,NaN,NaN,NaN,...,0.732501356484,0.844773790952,0.790354330709,0.757345971564,0.761989342806,0.797997644287,NaN,NaN,NaN,NaN
2,100690,2503400,25034,Amridge University,Montgomery,AL,36117-3553,NaN,NaN,NaN,...,0.5,0.636363636364,0.487012987013,0.609523809524,0.515625,0.577319587629,NaN,NaN,NaN,NaN
3,100706,105500,1055,University of Alabama at Huntsville,Huntsville,AL,35899,NaN,NaN,NaN,...,0.735384615385,0.839116719243,0.775700934579,0.77975376197,0.774757281553,0.788643533123,NaN,NaN,NaN,NaN
4,100724,100500,1005,Alabama State University,Montgomery,AL,36104-0271,NaN,NaN,NaN,...,0.308108108108,0.425287356322,0.354420731707,0.290803645402,0.300215982721,0.346017699115,NaN,NaN,NaN,NaN

In [56]:
print(len(k))

23272

In [59]:
len(df_2011)+len(df_2012)+len(df_2013)

23272